# Fabrication Part Get All Fabrication Body Connector Definitions Method

Source: https://www.revitapidocs.com/2026/b1cf2d24-1e32-af48-84cd-5e109c56f5a9.htm

---

| Fabrication Part Get All Fabrication Body Connector Definitions Method |
| --- |

Gets all connectors that are valid to be assigned to the part for a specified body connector
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<int> GetAllFabricationBodyConnectorDefinitions(
	Connector connector
)
```

```
Public Function GetAllFabricationBodyConnectorDefinitions (
	connector As Connector
) As IList(Of Integer)
```

```
public:
IList<int>^ GetAllFabricationBodyConnectorDefinitions(
	Connector^ connector
)
```

```
member GetAllFabricationBodyConnectorDefinitions :
        connector : Connector -> IList<int>
```

#### Parameters

connector Connector
:   The connector to to check against

#### Return Value

IList Int32
Returns an array of connector database identifiers Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

FabricationPart Class Autodesk.Revit.DB Namespace